In [6]:
import pandas as pd

data1 = {"Names": ["Jane", "Joen","Root"], "Age": [22, 23, 25]}
data2 = {"Names": ["Khawaja", "Ahmad","Abdullah"], "Age": [21, 23, 24]}
data3 = {"City": ["London", "Lisbon","Bahawalpur"], "Province": ["Punjab", "Sindh", "Blochistan"]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [7]:
#Concatenating data row wise
concatenated_data1 = pd.concat([df1, df2])
concatenated_data1

      Names  Age
0      Jane   22
1      Joen   23
2      Root   25
0   Khawaja   21
1     Ahmad   23
2  Abdullah   24

In [ ]:
#Concatenating data column wise
concatenated_data2 = pd.concat([concatenated_data1, df3], axis=1)
concatenated_data2

      Names  Age        City    Province
0      Jane   22      London      Punjab
1      Joen   23      Lisbon       Sindh
2      Root   25  Bahawalpur  Blochistan
0   Khawaja   21      London      Punjab
1     Ahmad   23      Lisbon       Sindh
2  Abdullah   24  Bahawalpur  Blochistan